<template>
  <div>
    <div>
      <b-img
        src="https://picsum.photos/1024/400/?image=41"
        fluid
        alt="Responsive image"
      ></b-img>
    </div>
    <div>
      <b-card>
        <b-media>
          <template #aside>
            <b-img
              blank
              blank-color="#ccc"
              width="64"
              alt="placeholder"
            ></b-img>
          </template>

          <h2 class="mt-0">استشارات</h2>
          <p>
            مكتبنا يوفر لكم معلومات لحياتكم اليومية ان كانت دراسية او عملية او
            معيشة خبرتتا في الحياة الكندية خلال اخر ٢٥ سنة يتخللها جميع نطاق
            الحياة لجعل إقامتكم بيننا اسعد. اين كانت الأسباب شركائنا من النواحي
            الاقتصادية و القانونية و اللوجستية تجعل مكتبنا هدف لكل الاحباب. كل
            ما نستطيع ان نعدكم به ان ABC Education Network يسعي جاهداً لخدمتكم
            لتحقيق اهدافكم.
          </p>

          <b-media> </b-media>
        </b-media>
      </b-card>
    </div>
    <div>
      <b-img
        src="https://picsum.photos/1024/400/?image=41"
        fluid
        alt="Responsive image"
      ></b-img>
    </div>
    <div>
      <b-card>
        <b-media>
          <template #aside>
            <b-img
              blank
              blank-color="#ccc"
              width="64"
              alt="placeholder"
            ></b-img>
          </template>

          <h2 class="mt-0">المعاهد و الجامعات</h2>
          <p>
            لا تقتصر خدمتنا علي تسجيلكم في اي مكان ولاكن علي ايجاد المكان
            المناسب بما يتناسب مع طموح اي شخص علي حده. ABC Education Network
            تؤمن بان كل شخص يختلف عن الاخر و ان حاجاتك تختلف عن اي شخص آخر لهذا
            نحن نفصل لك طريقك الدراسي بما هو لك و ليس للجميع. حدود علاقتنا مع
            المعاهد و الجامعات تتعدي خطوط الحدود الكندية و تتنقل بين سهول
            استراليا و نيوزلندا و ضفاف القارة العجوزة و ترسي في ميناء الولايات
            المتحدة . تواصلوا معنا لتسهيل اختياراتكم و إضفاء الراحة للبال من
            كثرة الاختيار.
          </p>
        </b-media>
      </b-card>
    </div>
    <div>
      <b-img
        src="https://picsum.photos/1024/400/?image=41"
        fluid
        alt="Responsive image"
      ></b-img>
    </div>
    <div>
      <b-card>
        <b-media>
          <template #aside>
            <b-img
              blank
              blank-color="#ccc"
              width="64"
              alt="placeholder"
            ></b-img>
          </template>

          <h2 class="mt-0">السكن</h2>
          <p>
            اين ماكنت للدراسة نوفر لك السكن المناسب لك و لي احبائك معضلة السكن
            تورق كل شخص يحل في مكان جديد لهذا ABC Education Network تعاونت مع
            افضل الشركات للتوفير السكن للطالب و ايضا لضمان ذلك موثق كل المتطلبات
            و الشروط قبل الموافقة لتاكيد حصول الطالب علي المكان المناسب له و
            الاجواء الي تتناسب مع عمره مستشار تعليمي خبرتنا في المجال التعليمي
            يتميز لاكثر من عقود فمنا من درس في سهول اوروبا القديمة و منا من درس
            في ربوع و ضفاف كندا الخلابه و منا من درس وترعرع علي ضفاف نهر النيل
            تمازج ثقفاتنا و تعليمنا يجعلنا نفهم الطالب حيث ماكان. فترة الدراسه
            هي من اصعب و اجمل فترات الحياه في عمر اي شخص منا هي الفترة التي
            تتضمن بناء القاعدة لمستقبل باهر او صعوبات مستمرة قرارك سيكون له
            توابع لسنوات طويلة لهذا ABC Education Network يعمل معك لتقديم كل
            المعلومات و النصايح و الخبرات التي تجعل من اختيارك هو الانسب.
            ملحوظة: نحن لانختار مستقبلك او نحدد لك المسار نحن نوضح لك المعلومات
            لنجعل القار المنبعث من داخلك يكون مبني علي اسس تعتمد عليها لبناء
            حياتك المخيم الصيفي هذا نو المستقبل لجيل الغد كثير منا لا ينمي الثقة
            و الاعتماد علي النفس لاطفالنا في فترة مبكره اثبتت الدراسات ان اعداد
            الطفل من فترة مبكرة ياثر علي شخصيته و ادراكه لمستقبله اكثر من اقرانه
            ABC Education Network توفر لك افضل المخيمات الصفية لاطفالك و
            مستقبلهم
          </p>
        </b-media>
      </b-card>
    </div>
  </div>
</template>
