<template>
  <div>
    <b-card
      overlay
      img-src="https://picsum.photos/900/250/?image=3"
      img-alt="Card Image"
      text-variant="white"
      title="Image Overlay"
      sub-title="Subtitle"
    >
      <b-card-text>
        Some quick example text to build on the card and make up the bulk of the
        card's content.
      </b-card-text>
    </b-card>
    <div class="bbb">
      <section class="page-section bg-light" id="portfolio">
        <div class="container">
          <div class="text-center">
            <h2 class="section-heading text-uppercase">Portfolio</h2>
            <h3 class="section-subheading text-muted">
              Lorem ipsum dolor sit amet consectetur.
            </h3>
          </div>

          <div class="col-lg-0 col-sm-0 mb-0 mb-sm-0">
            <div class="portfolio-item">
              <a
                class="portfolio-link"
                data-toggle="modal"
                href="#portfolioModal5"
              >
                <div class="portfolio-hover">
                  <div class="portfolio-hover-content">
                    <i class="fas fa-plus fa-3x"></i>
                  </div>
                  <b-button v-b-modal="'my-modal2'"
                    >معلومات عن المدينه</b-button
                  >
                  <b-modal id="my-modal2"
                    ><img
                      class="img-fluid"
                      src="https://github.com/StartBootstrap/startbootstrap-agency/blob/master/dist/assets/img/portfolio/05-thumbnail.jpg?raw=true"
                      alt=""
                    /><br />عاصمة أيرلندا دبلن عاصمة جمهورية أيرلندا وهي المدينة
                    الأكثر اكتظاظاً بالسكان فيها. وتقع دبلن قرب نقطة المنتصف
                    للساحل الشرقي الأيرلندي، عند مصب نهر ليفي. اشتق اسم المدينة
                    الإنجليزي من الاسم الأيرلندي Dubhlinn والذي يعني "البحيرة
                    السوداء". تأسست المدينة في الأصل كمستوطنة للفايكنغ، ثم تطورت
                    لتصبح "مملكة دبلن السكان ينتمي سكان أيرلندا إلى قومية
                    الأيريش Irish ويسمون بيـ أيريش-مان، وهم ينحدرون من الأصول
                    الكلتية. أصول معظم السكان هي كلتية، بينما هناك أيضاً أصول
                    إنجليزية. ترتفع كثافتهم في الشرق والجنوب، وحوالي ثلث السكان
                    في منطقة العاصمة، والنشاط البشري يتمثل في الزراعة والرعي،
                    والتعدين، والأخشاب، وبعض الصناعات الخفيفة، وأهم الغلات
                    الزراعية القمح، والشعير، والشوفان، والبنجر، والثروة
                    الحيوانية تتكون من الأبقار (7 ملايين رأس) والأغنام (4 ملايين
                    رأس)، وتنتج الفحم والغاز الطبيعي، والرصاص، والزنك، والفضة.
                    حيث أن عدد سكان ايرلندا حسب التعداد السكاني لعام 2018 بلغ
                    4,857,000 مليون نسمة. الجغرافيا تتكاثر السهول في وسط البلاد،
                    التي تحيطها هضاب كلما اتجهنا جهة البحر ويتخللها عدد كبير من
                    البحيرات. نهر شانون، الذي يخترق البلاد من الشمال إلى الجنوب،
                    هو أطول أنهر البلاد، كما أن بحيرة لوغ نيغ (Lough Neagh) هي
                    أكبر البحيرات. هناك العديد من المحميات الطبيعية في أيرلندا،
                    وهناك معالم جغرافية رائعة مثل أجراف موهر على المحيط الأطلسي
                    في مقاطعة كلير. تقع أيرلندا في الجزء الشمالي الغربي من
                    القارة الأوروبية، شمال المحيط الأطلنطي، يفصل بينها وبين
                    بريطانيا البحر الأيرلندي. الأرض تحتل أراضي جمهورية أيرلندا
                    3/4 من أراضي الجزيرة الأيرلندية، ويغلب عليها المظهر المستوي،
                    وتتناثر المرتفعات في القسم الشرقي والجنوبي من أيرلندا،
                    وتنبسط الأراضي في الجزئين الأوسط والغربي، وتبلغ أقصى انخفاض
                    لها في المنطقة الوسط حيث تنتشر بعض البحيرات المناخ مناخ
                    أيرلندا بارد في الشتاء مع وصول درجات الحرارة إلى مستوى
                    التجمد في بقاع كثيرة من البلاد، ومعتدل البرودة في الصيف مع
                    تساقط شبه يومي للأمطار التي تتساقط معظم شهور السنة. ويتأثر
                    مناخ أيرلندا بشكل كبير بالرياح الغربية الآتية من المحيط
                    الأطلسي، وحالة الطقس اليومية في أيرلندا من أكثر الطقوس تقلبا
                    على مستوى العالم ويصعب في فترات متفرقة خلال السنة التنبؤ
                    بحالتها. اللغة اللغتان الرسميتان هما الأيرلندية(الغيلية)
                    والإنجليزية، تعد الأخيرة اللغة الرسمية الثانية في البلاد،
                    تعلم الأيرلندية في المدارس هو إجباري بينما الإنجليزية فقط في
                    المراحل الأولى.و ذلك لأسباب وطنية الديانة يتبع حوالي 92% من
                    الأيرلنديين الديانة المسيحية الكاثوليكية. تعرف الكنيسة
                    الكاثوليكية في أيرلندا بقوتها وتزمتها في بعض الأمور. على
                    سبيل المثال، تم فقط سنة 1995 السماح بالطلاق، حيث أن ذلك
                    ممنوع بين الكاثوليك. كما أن الإجهاض كان ممنوعا حتى سُمِحَ به
                    في العام 2018 بعد استفتاء شعبي. الزراعة السوق الأيرلندي صغير
                    مقارنة مع مثيلاته في أوروبا ولكنه يتمتع بنمو عالي ومستقر.
                    حيث بلغ في الأعوام 1995 - 2000 نسبة 10%. دخل الفرد الأيرلندي
                    نسبة إلى الناتج الإجمالي العام هو رابع أعلى دخل بالعالم، حيث
                    بلغ حوالي 40 ألف دولار أمريكي عام 2005. الزراعة، التي كانت
                    يوماً ما أهم قطاعات الاقتصاد، تأتي بالمرتبة الثانية بعد
                    الصناعة، تشكل 38% من الناتج الإجمالي للبلاد و80% من الصادرات
                    وتشغل 28% من السكان. الصناعات صناعة البرمجيات جعلت من
                    أيرلندا أكبر مصدر للبرامج والخدمات المتعلقة بالبرمجيات
                    (Software) في العالم. المعادن أهم الموارد الطبيعة هي الرصاص،
                    الجبس، الحجر الكلسي والخارصين. الثقافة تشتهر أيرلندا
                    بثقافتها الكلتية وخاصة الموسيقى الأيرلندية. رغم قلة عدد سكان
                    أيرلندا فإن الثقافة الأيرلندية تمكنت من الانتشار في أوروبا
                    والعالم برغم التأثير الكبير للثقافة الإنجليزية المجاورة.
                    يرجع الفضل إلى ذلك إلى العديد من مشاهير أيرلندا كعشرات
                    الأدباء الأيرلنديين العظام، منهم: برنارد شو (Shaw)، أوسكار
                    وايلد (Wilde) وجورج باركلي (Barkley). هناك أيضاً عدد من
                    مشاهير مغننين البوب يأتون من أيرلندا مثل ذا كورس (The
                    Corrs)، يو تو (U2) وكيلتك وومان. التعليم عدل النظام التعليمي
                    في أيرلندا شبيه بالأنظمة الأوروبية الأخرى. هناك التعليم
                    الابتدائي، الثانوي والعالي. أهم جامعات البلاد هي كلية
                    ترينتي، جامعة مدينة دبلن، معهد دبلن للتكنولوجيا، جامعة
                    أيرلندا الوطنية، جامعة دبلن وجامعة ليميريك، جامعة كورك،
                    جامعة جالواي، وكلية التقنية في مدينة تريلي (ITT) والكلية
                    الملكية للجراحين في إيرلندا (RCSI)، وهذه الأخيرة قامت بمد
                    فروع لها عبر المحيط في البحرين وبننج ماليزيا. هذا ويعتمد
                    اقتصاد جمهورية إيرلندا جزئيا على التعليم حيث تنتشر العديد من
                    المعاهد والكليات والجامعات في مختلف المدن والتي تقدم دورات
                    لتعليم اللغة الإنجليزية للأجانب وإدارة الأعمال والمحاسبة
                    والفندقة والتمريض وما إلى ذلك، ويعتمد القبول في التخصصات
                    المختلفة غير اللغة الإنجليزية على اجتياز اختبار الآيلتس
                    بالدرجة التي تحددها كل جهة تعليمية. النقل والمواصلات خط
                    الترام (Luas)) قطار كهربائي يوفر خدمة النقل من القرى القريبة
                    من دبلن وإليها ، السكك الحديدية الرحلات الجويةالموانى النقل
                    العام الحافلات الموانى توجد في العاصمة دبلن شبكة ممتازة
                    ومنظمة من الحافلات المتطورة والتي تخدم مختلف شرائح المجتمع
                    بما في ذلك كبار السن وذوي الاحتياجات الخاصة بكل سهولة ويسر،
                    ففي دبلن تجد شركة دبلن باص (Dublin Bus) والتي توفر نقل
                    لمختلف مناطق العاصمة دبلن، وتقدم هذه الشركة خدمات وحافلات
                    خاصة بأسعار مناسبة لوجهات خاصة مثل: خط المطار (إير لنك)
                    Airlink وهو خدمة سريعة للباص على مدار الساعة من مركز المدينة
                    ومحطات القطار الرئيسة في دبلن وإلى المطار. رحلة باص دبلن
                    (دبلن باص تور) Dublin bus tour وهذا الباص يأخذك في جولة حول
                    أهم المعالم السياحية الموجودة في العاصمة وتستطيع أن تنزل من
                    الباص في أي نقطة من نقاط توقفه المحددة لتشاهد ما تريده ثم
                    تعود لخط الباص مرة أخرى بنفس تذكرتك التي تكون صالحة لمدة 24
                    ساعة مع العلم بأنك ستجد الباص في نقطة التوقف خلال أقل من 15
                    دقيقة من نقاط التوقف البالغ عددها 23 نقطة حيث أنك ستجد
                    العديد من الحافلات المتخصصة لهذا الغرض فقط. باص الساحل
                    الشمالي والقلاع (نورث كوست اند كاسل) Dublin Tour - North
                    Coast & Castle حيث أنه مخصص أيضا لغرض السياحة ليأخذك في جولة
                    على شواطئ البلاد الشمالية والقلاع القديمة الأثرية المنتشرة
                    في الشمال. باص الساحل الجنوبي والحدائق (ساوث كوست اند
                    جاردنز) Dublin Tour - South Coast & Gardens حيث أنه مخصص
                    كذلك لغرض السياحة ليأخذك في جولة على شواطئ البلاد الجنوبية
                    والحدائق المنتشرة فيه. باص الأشباح (جوست باص) Dublin Tour -
                    GhostBus حيت أنه مخصص لعشاق الإثارة والمغامرات والتشويق. في
                    مدينة كورك ومدينة ليمرك توفر شركة (Iarnród Éireann) شبكة
                    النقل داخل المدينة. هذا وتوفر وسائل النقل العامة والسكك
                    الحديدية خصما خاصا للطلاب دون استثناء في حالة حصولهم على
                    بطاقة الطالب الخاصة بتخفيض أسعار النقل والتي تكون فعالة لمدة
                    سنة كاملة بملغ زهيد وقدره 12 يورو فقط. –والحافلات في أيرلندا
                    يوجد نوعان:مسالمة للبيئة ومضرة للبيئة الإعلام والاتصالات عدل
                    يوجد في أيرلندا أربعة محطات تليفزيونية (RTE1 وRTE2 وTV3
                    وTG4) وثلاثة صحف وطنية (The Irish Times وIrish Independent
                    وIrish Examiner) شبكة الاتصال السلكية المتوفرة هي: إيركوم
                    (eircom) وشبكات الاتصال اللاسلكية المتوفرة للهواتف النقالة
                    كما يلي هي: شبكات عالمية معروفة للهواتف الذكية مشغلة للجيل
                    الثالث فودافون، أو2 (O2)، ثري (3)، ميتيور (meteor) شبكات
                    تجارية للاتصال لاتشغل خدمات الجيل الثالث تيسكو (TESCO) شبكة
                    لاسلكية جديدة تحت الإنشاء والتسويق إيركوم (eircom) هذا ويوجد
                    في إيرلندا العديد من الشركات المشغلة لخدمات الإنترنت مثل:
                    إيركوم )(eircom)
                  </b-modal>
                </div>
                <b-button v-b-modal="'my-modal1'">
                  <img
                    class="img-fluid"
                    src="https://github.com/StartBootstrap/startbootstrap-agency/blob/master/dist/assets/img/portfolio/05-thumbnail.jpg?raw=true"
                    alt=""
                  /><br />
                  جامعة دبلن
                </b-button>
              </a>
              <b-modal id="my-modal1"
                ><img
                  class="img-fluid"
                  src="https://github.com/StartBootstrap/startbootstrap-agency/blob/master/dist/assets/img/portfolio/05-thumbnail.jpg?raw=true"
                  alt=""
                /><br />عن جامعه دبلن كلية دبلن الجامعية جامعة في دبلن، أيرلندا
                Disambigua compass.svg ميّز عن جامعة دبلن. كلية جامعة دبلن
                (بالإنجليزية: University College Dublin)‏ و(بالأيرلندية: An
                Coláiste Ollscoile, Baile Átha Cliath) كلية أيرلندية تقع في دبلن
                أنشئت عام 1854 من قبل جون هنري نيومان، وهي جامعة رائدة في
                الدراسة على مستوى الدراسات العليا، وتقدم العديد من الدورات
                الدراسية في كلياتها في مجالات الفنون والهندسة. الجامعة اليوم هي
                أكبر جامعة في أيرلندا وتعد موطن لحوالي 5,000 طالب أجنبي الأقسام
                يوجد أمام الطلاب المقبلين على الدراسة أكثر من 80 برنامجًا من
                برامج البكالوريوس والدراسات العليا وبرامج تعليم المهارات
                التنفيذية، للاختيار من بينها. وتشمل الخيارات تخصصات بدوام كامل
                وبدوام جزئي، بالإضافة إلى التعلم خارج الحرم الجامعي. تُدرس هذه
                البرامج من قبل الكليات الخمس التالية: كلية الأعمال تشمل الأعمال
                التجارية العالمية، المحاسبة، المالية، التسويق، الإدارة، الموارد
                البشرية والمزيد. الإنسانيات والعلوم الاجتماعية تشمل اللغة
                الإنجليزية والاتصالات واللغات والتاريخ والجغرافيا والقانون
                والفلسفة والموسيقى وأكثر من ذلك. كلية التربية تشمل تعليم الفنون،
                التنمية البشرية، التعليم الشامل والخاص، السياسات والممارسات،
                التعليم في مرحلة الطفولة المبكرة وغيره الكثير. الهندسة والحوسبة
                يشمل الحوسبة، الهندسة الإلكترونية والصناعة والهندسة الميكانيكية.
                العلوم والصحة شروط الالتحاق تشجع الجامعة الطلاب الأجانب على
                التقديم بأسرع وقت يمكن، ما يجعل عملية التقديم أسهل. يوجد شروط
                عامة لتقديم الطلبات ومتطلبات معينة لمختلف التخصصات والبرامج.
                متطلبات اللغة الإنجليزية نظرًا لتدريس كافة التخصصات باللغة
                الإنجليزية، سيتعين على الطلاب الأجانب الذين لا يتحدثون
                الإنجليزية كلغة أم إثبات إجادة اللغة الإنجليزية لديهم. يمكن
                القيام بذلك من خلال إجراء أحد اختبارات اللغة التالية، أو ما
                يعادلها: الآيلتس - الحد الأدنى 6.5، مع ما لا يقل عن 6.0 في كل
                مهارة (تتطلب كلية الأعمال درجة 6.5 في الكتابة والمحادثة). التوفل
                - الحد الأدنى 92 (تتطلب كلية الأعمال تتطلب درجة لا تقل عن 21 في
                كل قسم). اختبار بيرسون الأكاديمي- درجة لا تقل عن 63، مع ما لا
                يقل عن 59 في كل قسم (تتطلب كلية الأعمال درجة 63 في الكتابة
                والتحدث). سيحتاج الطلاب من البلدان التالية إلى التحقق من متطلبات
                الخاصة باللغة: البرازيل، الصين، الهند، اليابان، كوريا، الكويت،
                ماليزيا، عمان، المملكة العربية السعودية، الإمارات العربية
                المتحدة، الولايات المتحدة الأمريكية وفيتنام. الدراسات العليا
                بشكل عام، يُشترط الحصول على درجة بكالوريوس مكافئة لدرجة 1: 2 حتى
                يتمكن الطلاب من التأهل لبرنامج الماجستير الذي يتم تدريسه. كما
                يلزم أحياناً أن يملك الطالب الخبرة التعليمية والمهنية والشخصية
                في بعض برامج الدراسات العليا. من الضروري أيضًا أن يلبي الطلاب
                متطلبات اللغة الإنجليزية في الجامعة. لمزيد من المعلومات، يمكن
                للطلاب الرجوع إلى موقع الجامعة الإلكتروني. التسهيلات التسهيلات
                تشهد الجامعة توسعاً سريعاً بما في ذلك التطورات الأخيرة مثل إقامة
                مركز طلابي جديد يجمع بين مرافق الأنشطة الاجتماعية والثقافية
                والعالمية وأنشطة تنظيم المشاريع. يستفيد الطلاب من مجموعة كبيرة
                ومتنوعة من مرافق التعلم بالإضافة إلى المرافق الاجتماعية والشخصية
                مثل: متجر الكتب البنك مصفف شعر الصيدلة مطبعة دوائر الترجمة
                التحريرية خيارات تناول الطعام مركز هيلكس للفنون المسرحية. مسارح
                التعليم الحديث المقاهي والمطاعم المكتبة يوجد مكتبتان في الجامعة:
                مكتبة أورايلي في حرم جلاسنيفن الجامعي ومكتبة كريجان في حرم
                باتريك. تحتويان على العديد من مساحات الدراسة المريحة، وموارد
                للتعلم ومجلات وكتب ودعم مقدم من الخبراء وغيرها الكثير. الرياضة
                والرفاهية النوادي والمجموعات هم قلب الجامعة، يوجد أكثر من 150
                نادي ومجموعة. تفتخر الجامعة بنادي رياضي حائز على الكثير من
                الجوائز، أحدث المباني والملاعب الرياضية. يعد ملعب كرة القدم
                الرياضي مركز التجمع الرياضي في الجامعة. من خلال الرياضات
                والرفاهية التي تقدمها الجامعة، سيحافظ الطلاب على لياقتهم البدنية
                والصحية، كما أنهم سيقضون وقتاً ممتعاً في مختلف الألعاب الرياضية
                والأنشطة. دور العبادة يستطيع الطلاب حضور مختلف الدوائر الدينية
                اليومية، كما بإمكانهم إيجاد مناطق خاصة للوضوء والاغتسال وأداء
                العبادات والتأمل. تُقام الاحتفالات لجميع الأديان، حيث تجمع
                فعاليات المجتمع بين كافة الطلاب. السكن والإقامة يمكن لطلاب
                البكالوريوس الأجانب الذين يرغبون بالعيش الحرم أن يقيموا في السكن
                حيث يوجد غرفة نوم خاصة ومطبخ وغرفة معيشة مشتركة. كما أن الغرف
                مؤثثة بشكل كامل، ويوجد إنترنت لاسلكي، كما يوجد حمامات ملحقة
                بالغرف. وسائل الترفيه تقيم الجامعة مهرجانات كوميدية، وتستضيف
                مغنيين وفرق موسيقية عازفة خلال السنة. نتائج الخريجين 92% من طلاب
                الجامعة الخريجين يدخلون إلى سوق العمل المهني أو يكملون دراساتهم
                بعد 6 أشهر تخرجهم. الخدمة المهنية (دائرة التوظيف) أثناء
                دراساتهم، يستطيع الطلاب حديثو التخرج الاستفادة من الخدمة المهنية
                المكثفة في الجامعة. يعمل مركز فرص العمل الذي تقدمه وحدة خدمات
                التوظيف على تمكين الطلاب للوصول من هدفهم المهني. يساعد
                المستشارين المهنيين ذوي الخبرة الطلاب على سلك المسار المناسب
                لهم. تقدم دائرة التوظيف تعليم ذو جودة عالية ومبادرات تنمية،
                والعديد من الفرص والدعم الملائم للطالب في مختلف المراحل التي يمر
                بها. مثل: مهارات إجراء المقابلات الشخصية إعداد مركز التقييم
                المقابلات الشخصية التدريبية حلقات عمل حول البحث عن عمل وصنع
                العلامة التجارية التخطيط المهني التوجيه المهني الشخصي اختبارات
                الكفاءة والقياس النفسي. المعارض الوظيفية دورات توجيهية حفلات
                للتعارف وتبادل الأفكار فعاليات وحلقات نقاش عن مختلف القطاعات.
                تقييمات وانطباعا تعتبر دبلن مركز التعليم الرئيسي في أيرلندا، إذ
                أن فيها ثلاث جامعات والعديد من مؤسسات التعليم الأخرى. كما يوجد
                في دبلن 20 معهداً. ويشار هنا إلى أن دبلن كانت العاصمة الأوروبية
                2012 تعتبر جامعة دبلن الجامعة الأقدم في أيرلندا، إذ تأسست في
                القرن السادس عشر، وتقع في قلب المدينة، وهذا وقد تأسست الكلية
                التأسيسية الوحيدة، كلية الثالوث (دبلن)، بموجب أمر ملكي أصدرته
                الملكة إليزابيث الأولى عام 1592.
              </b-modal>
              <div class="portfolio-caption"></div>
            </div>
          </div>
        </div>
      </section>
    </div>
  </div>
</template>
<script>
export default {
  data() {
    return {
      modalShow: false,
    };
  },
};
</script>
